###############################################################################
# Created by write_sdc
# Fri Feb 20 08:07:47 2026
###############################################################################
current_design cpu_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_addr[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_addr[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_addr[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_addr[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_addr[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_addr[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_re}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_wdata[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_we}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_addr[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_addr[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_addr[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_addr[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_addr[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_addr[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_wdata[9]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_imem_we}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_addr[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_addr[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_addr[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {current_instr[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pc_out[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_dmem_rdata[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tb_reg_rd_data[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {current_instr[31]}]
set_load -pin_load 0.0334 [get_ports {current_instr[30]}]
set_load -pin_load 0.0334 [get_ports {current_instr[29]}]
set_load -pin_load 0.0334 [get_ports {current_instr[28]}]
set_load -pin_load 0.0334 [get_ports {current_instr[27]}]
set_load -pin_load 0.0334 [get_ports {current_instr[26]}]
set_load -pin_load 0.0334 [get_ports {current_instr[25]}]
set_load -pin_load 0.0334 [get_ports {current_instr[24]}]
set_load -pin_load 0.0334 [get_ports {current_instr[23]}]
set_load -pin_load 0.0334 [get_ports {current_instr[22]}]
set_load -pin_load 0.0334 [get_ports {current_instr[21]}]
set_load -pin_load 0.0334 [get_ports {current_instr[20]}]
set_load -pin_load 0.0334 [get_ports {current_instr[19]}]
set_load -pin_load 0.0334 [get_ports {current_instr[18]}]
set_load -pin_load 0.0334 [get_ports {current_instr[17]}]
set_load -pin_load 0.0334 [get_ports {current_instr[16]}]
set_load -pin_load 0.0334 [get_ports {current_instr[15]}]
set_load -pin_load 0.0334 [get_ports {current_instr[14]}]
set_load -pin_load 0.0334 [get_ports {current_instr[13]}]
set_load -pin_load 0.0334 [get_ports {current_instr[12]}]
set_load -pin_load 0.0334 [get_ports {current_instr[11]}]
set_load -pin_load 0.0334 [get_ports {current_instr[10]}]
set_load -pin_load 0.0334 [get_ports {current_instr[9]}]
set_load -pin_load 0.0334 [get_ports {current_instr[8]}]
set_load -pin_load 0.0334 [get_ports {current_instr[7]}]
set_load -pin_load 0.0334 [get_ports {current_instr[6]}]
set_load -pin_load 0.0334 [get_ports {current_instr[5]}]
set_load -pin_load 0.0334 [get_ports {current_instr[4]}]
set_load -pin_load 0.0334 [get_ports {current_instr[3]}]
set_load -pin_load 0.0334 [get_ports {current_instr[2]}]
set_load -pin_load 0.0334 [get_ports {current_instr[1]}]
set_load -pin_load 0.0334 [get_ports {current_instr[0]}]
set_load -pin_load 0.0334 [get_ports {pc_out[31]}]
set_load -pin_load 0.0334 [get_ports {pc_out[30]}]
set_load -pin_load 0.0334 [get_ports {pc_out[29]}]
set_load -pin_load 0.0334 [get_ports {pc_out[28]}]
set_load -pin_load 0.0334 [get_ports {pc_out[27]}]
set_load -pin_load 0.0334 [get_ports {pc_out[26]}]
set_load -pin_load 0.0334 [get_ports {pc_out[25]}]
set_load -pin_load 0.0334 [get_ports {pc_out[24]}]
set_load -pin_load 0.0334 [get_ports {pc_out[23]}]
set_load -pin_load 0.0334 [get_ports {pc_out[22]}]
set_load -pin_load 0.0334 [get_ports {pc_out[21]}]
set_load -pin_load 0.0334 [get_ports {pc_out[20]}]
set_load -pin_load 0.0334 [get_ports {pc_out[19]}]
set_load -pin_load 0.0334 [get_ports {pc_out[18]}]
set_load -pin_load 0.0334 [get_ports {pc_out[17]}]
set_load -pin_load 0.0334 [get_ports {pc_out[16]}]
set_load -pin_load 0.0334 [get_ports {pc_out[15]}]
set_load -pin_load 0.0334 [get_ports {pc_out[14]}]
set_load -pin_load 0.0334 [get_ports {pc_out[13]}]
set_load -pin_load 0.0334 [get_ports {pc_out[12]}]
set_load -pin_load 0.0334 [get_ports {pc_out[11]}]
set_load -pin_load 0.0334 [get_ports {pc_out[10]}]
set_load -pin_load 0.0334 [get_ports {pc_out[9]}]
set_load -pin_load 0.0334 [get_ports {pc_out[8]}]
set_load -pin_load 0.0334 [get_ports {pc_out[7]}]
set_load -pin_load 0.0334 [get_ports {pc_out[6]}]
set_load -pin_load 0.0334 [get_ports {pc_out[5]}]
set_load -pin_load 0.0334 [get_ports {pc_out[4]}]
set_load -pin_load 0.0334 [get_ports {pc_out[3]}]
set_load -pin_load 0.0334 [get_ports {pc_out[2]}]
set_load -pin_load 0.0334 [get_ports {pc_out[1]}]
set_load -pin_load 0.0334 [get_ports {pc_out[0]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[31]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[30]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[29]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[28]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[27]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[26]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[25]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[24]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[23]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[22]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[21]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[20]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[19]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[18]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[17]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[16]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[15]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[14]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[13]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[12]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[11]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[10]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[9]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[8]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[7]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[6]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[5]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[4]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[3]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[2]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[1]}]
set_load -pin_load 0.0334 [get_ports {tb_dmem_rdata[0]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[31]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[30]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[29]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[28]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[27]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[26]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[25]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[24]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[23]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[22]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[21]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[20]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[19]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[18]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[17]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[16]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[15]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[14]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[13]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[12]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[11]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[10]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[9]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[8]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[7]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[6]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[5]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[4]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[3]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[2]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[1]}]
set_load -pin_load 0.0334 [get_ports {tb_reg_rd_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_re}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_dmem_wdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_imem_wdata[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_reg_rd_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_reg_rd_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {tb_reg_rd_addr[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
